//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
//public static int length(char[] arr));
//Описание: Метод возвращает длину массива символов arr.
//Считает количество символов в массиве arr и возвращает это значение.
//
//
//public static char charAt(int index);
//Описание:
//Метод возвращает символ, находящийся по указанному индексу в массиве.
//Берет массив символов и индекс index, проверяет, существует ли символ на этом месте. Если индекс корректен, возвращает символ.
//
//
//public static int indexOf(char simvol);
//Описание:
//Метод возвращает индекс первого вхождения символа simvol в массиве. Если символ не найден, возвращает -1.
//Проходит по массиву слева направо, ищет первый символ, совпадающий с simvol. Если символ найден, возвращает его индекс. Если нет, возвращает -1.
//
//
//
//public static int lastIndexOf(char simvol);
//Описание:
//Метод возвращает индекс последнего вхождения символа simvol в массиве. Если символ не найден, возвращает -1.
//Проходит по массиву справа налево, ищет последний символ, совпадающий с simvol. Если символ найден, возвращает его индекс. Если нет, возвращает -1.
//
//
//
//public static char[] toUpperCase(char[] arr) ;
//Описание:
//Метод возвращает новый массив символов, где все буквы преобразованы в верхний регистр.
//Для каждой буквы в массиве проверяет, является ли она строчной (например, a-z). Если да, то заменяет её на соответствующую заглавную (например, A-Z).
//Если символ не является буквой, он остается неизменным.
//
//
//
//public static char[] toLowerCase(char[] arr) ;
//Описание:
//Метод возвращает новый массив символов, где все буквы преобразованы в нижний регистр.
//Для каждой буквы в массиве проверяет, является ли она заглавной (например, A-Z). Если да, то заменяет её на соответствующую строчную (например, a-z).
//Если символ не является буквой, он остается неизменным.
//
//
//
//public static char[] trim(char[] arr );
//Метод возвращает новый массив символов, из которого удалены начальные и конечные пробелы.
//Удаляет все пробелы (символы ' ') с начала и конца массива.
//Пробелы внутри строки остаются неизменными.
    }
}